# 前往npc
bangpai_npc = [
    {"tap": {"x": 2096, "y": 302, "sleep": 2}},  # 展开按钮
    {"tap": {"x": 1878, "y": 864, "sleep": 2}},  # 点击生活技能
    {"tap": {"x": 1618, "y": 351, "sleep": 2}},  # 点击帮派跑商的前往
]

# 开始帮派跑商
paoshang = [
    {"tap": {"x": 1939, "y": 586, "sleep": 2}},  # 点击参与跑商
    {"tap": {"x": 1380, "y": 736, "sleep": 2}},  # 点击确认参与
]

# 商人地点
npc_position = [
    {"tap": {"x": 1094, "y": 568, "sleep": 2}},  # 严州城
    {"tap": {"x": 1204, "y": 836, "sleep": 2}},  # 天风坪
    {"tap": {"x": 806, "y": 168, "sleep": 2}},  # 羡鱼港
    {"tap": {"x": 1176, "y": 106, "sleep": 2}},  # 雪庐书院
    {"tap": {"x": 1266, "y": 310, "sleep": 2}},  # 万劫山庄
    {"tap": {"x": 1586, "y": 66, "sleep": 2}},  # 全氏山庄
    {"tap": {"x": 1704, "y": 246, "sleep": 2}},  # 文府别院
]

npc_paoshang = {"tap": {"x": 1780, "y": 700, "sleep": 2}}  # 商人帮会跑商按钮

# 出售
sell = [
    {"tap": {"x": 1860, "y": 400, "sleep": 2}},  # 出售栏
    {"tap": {"x": 1420, "y": 860, "sleep": 2}},  # 出售按钮
]

# 购买
buy = [
    {"tap": {"x": 1860, "y": 250, "sleep": 2}},  # 购买栏
    {"tap": {"x": 1420, "y": 860, "sleep": 2}},  # 购买按钮
]
# todo 选择值的商品  按住"+"

# 关闭交易窗口
close_win = {"tap": {"x": 1864, "y": 102, "sleep": 2}}

# 跑商结束返回帮派
final = {"text_pic": [174, 268, 531, 339]}
