start = [
    {"tap": {"x": 1654, "y": 691, "sleep": 1}},  # 宠物切磋
]

select = [
    {"tap": {"x": 834, "y": 535, "sleep": 0.5}},  # 选择第一个宠物
    {"tap": {"x": 1480, "y": 900, "sleep": 15}},  # 准备
]

select1 = [
    {"tap": {"x": 834, "y": 535, "sleep": 0.5}},  # 选择第一个宠物
    {"tap": {"x": 1480, "y": 900, "sleep": 7.5}},  # 准备
]

out = [
    {"tap": {"x": 1144, "y": 112, "sleep": 1}},  # 退出
    {"tap": {"x": 1460, "y": 770, "sleep": 7}},  # 退出
]

end = [
{"tap": {"x": 1144, "y": 1008, "sleep": 0}},  # 结束
]