matching = [
    {"tap": {"x": 1656, "y": 61, "sleep": 2}},  # 活动按钮
    {"tap": {"x": 690, "y": 1020, "sleep": 2}},  # 纷争按钮
    {"tap": {"x": 1610, "y": 420, "sleep": 2}},  # 生死剑冢按钮
    {"tap": {"x": 1790, "y": 870, "sleep": 2}}  # 匹配按钮
]

close_win = [
    {"tap": {"x": 1860, "y": 110, "sleep": 2}},  # 关闭匹配界面
    {"tap": {"x": 2090, "y": 75, "sleep": 2}}  # 关闭活动洁面
]

# 结束
final = {
    "tap": {"x": 890, "y": 760, "sleep": 2},
    # "text_pic": [756, 720, 1020, 795]
    # "text_pic": [844, 730, 939, 777]
    "text_pic": [900, 460, 1400, 530]
}
